app/Http/Requests/HaigoKeyMeiRequest.php

select exists(select * from "m_haigo_key_mei" where "haigo_key" = 'pS90R' and "hin_cd" = '90850100' and "kikaku_cd" = '1' and "del_flg" = 0) as "exists"
---
    public function withValidator($validator) {
        $validator->addExtension('haigo_key_mei_exist', function ($attribute, $value, $parameters, $validator) {
            $haigoKeyMei = DB::table('m_haigo_key_mei')->where('haigo_key', request()->get('haigo_key'))->where('hin_cd', request()->get('hin_cd'))->where('kikaku_cd', request()->get('kikaku_cd'))->where('del_flg', false)->exists();