app/Http/Controllers/HaigoKeyController.php

select * from "m_haigo_key" where ("del_flg" = 0 and "haigo_key" = 'pS90R') limit 1
---
    private function showForm($mode, $key)
    {
        $GridSearch     = new GridSearch('PG402');
        $mCode          = new MCode();
        $listSeihinKbn  = $mCode->getDataCombobox($this->code);

        // form
        $qbHaigoKey     = MHaigoKey::where(['del_flg' => FALSE, 'haigo_key' => $key]);
        $recordHaigoKey = $qbHaigoKey->first();

update "m_haigo_key" set "haigo_key_nm" = 'あいうえお０３', "seihin_kbn" = '2', "flat_base_keisu" = '32.0000', "upd_dt" = '2023-10-20 08:10:16', "upd_user_id" = 99 where "haigo_key" = 'pS90R'
---
            }

            if ($formInputs['mode'] == 'edit') {
                $res = MHaigoKey::where('haigo_key', $formInputs['haigo_key'])
                                ->update([
                                    'haigo_key_nm'      => $formInputs['haigo_key_nm'] ?? '',
                                    'seihin_kbn'        => $formInputs['seihin_kbn'] ?? '',
                                    'flat_base_keisu'   => $formInputs['flat_base_keisu'] ?? 0,
                                    'upd_dt'            => now(),
                                    'upd_user_id'       => 99,
                            ]);