app/Http/Controllers/HaigoKeyMeiController.php

    public function store(HaigoKeyMeiRequest $rq)
    {
        DB::begintransaction();
        try {
            $this->mHaigoKeyMei->insert([
                'haigo_key' => $rq->haigo_key,
                'hin_cd' => $rq->hin_cd,
                'kikaku_cd' => $rq->kikaku_cd,
                'ganryo_kbn' => $rq->ganryo_kbn ?? '',
                'bihikuru_keisu' => $rq->bihikuru_keisu ?? 0,
                'tonyu_group_no' => $rq->tonyu_group_no ?? 0,
                'disp_jun' => $rq->disp_jun ?? 0,
                'ver' => 0,
                'del_flg' => false,
                'upd_user_id' => \Auth::check() ? \Auth::user()->user_id : '',
                'upd_dt' => Carbon::now(),
                'ins_dt' => Carbon::now(),
                'ins_user_id' => \Auth::check() ? \Auth::user()->user_id : '',
            ]);
---
insert into "m_haigo_key_mei" ("haigo_key", "hin_cd", "kikaku_cd", "ganryo_kbn", "bihikuru_keisu", "tonyu_group_no", "disp_jun", "ver", "del_flg", "upd_user_id", "upd_dt", "ins_dt", "ins_user_id") values ('pS90R', '90850100', '1', '40', 0, 0, 0, 0, 0, 1, '2023-10-20 03:27:10', '2023-10-20 03:27:10', 1)

    public function ajax(Request $rq)
    {
        if(!$rq->ajax()) {
            abort(403);
        }

        if($rq->key) {
            $id = $rq->id;
            switch ($rq->key) {
                case 'hin_cd':
                    $data['hin_cd'] = DB::table('m_hinmoku')->where('del_flg', false)->where('hin_cd', $id)->first();
---
select * from "m_hinmoku" where "del_flg" = 0 and "hin_cd" = '90850100' limit 1