app/Models/MCode.php

select "kbn", "name" from "m_code" where "del_flg" = 0 and "code" = 'K51' order by "disp" asc
---
    public function getDataCombobox($code)
    {
        $res = self::query()
            ->select(['kbn', 'name'])
            ->where('del_flg', FALSE)
            ->where('code', $code)
            ->orderBy('disp')
            ->pluck('name', 'kbn');