app/Models/MHaigoKey.php

select * from "m_haigo_key" inner join "m_code" on "m_code"."kbn" = "m_haigo_key"."seihin_kbn" and "m_code"."code" = 'K51' and "m_code"."del_flg" = false where ("m_haigo_key"."haigo_key" = 'pS90R' and "m_haigo_key"."del_flg" = 0) limit 1
---
    public function getHaigoKeyJoinCode($haigoKeyCd, $code) {
        return self::query()
            ->join('m_code', function($join) use ($code) {
                $join->on('m_code.kbn', '=', 'm_haigo_key.seihin_kbn');
                $join->on('m_code.code', '=', DB::raw("'".$code."'"));
                $join->on('m_code.del_flg', '=', DB::raw('false'));
            })
            ->where([
                ['m_haigo_key.haigo_key', '=', $haigoKeyCd],
                ['m_haigo_key.del_flg', '=', false]
            ])
            ->first();