app/Models/MHinmoku.php

    public function scopeList($query, $where = array()) {
        if(!empty($where)) {
            $query->where($where);
        }
        return $query->where('del_flg', '=', false)->orderBy('hin_cd', 'ASC')->get();
---
select * from "m_hinmoku" where "del_flg" = 0 order by "hin_cd" asc