app/Models/MKskyoten.php

    public function getDataCombobox()
    {
        $res = self::query()->getQuery()
                ->select(['ktn_cd', 'ktn_nm'])
                ->where('del_flg', FALSE)
                ->orderBy('ktn_cd')
                ->pluck('ktn_nm', 'ktn_cd');
---
select "ktn_cd", "ktn_nm" from "m_kskyoten" where "del_flg" = 0 order by "ktn_cd" asc